###################################################################

# Created by write_sdc on Thu Dec  16 06:10:48 2021 

###################################################################
set sdc_version 1.7

set_load -pin_load 3.40189 [get_ports {P[13]}]
set_load -pin_load 3.40189 [get_ports {P[12]}]
set_load -pin_load 3.40189 [get_ports {P[11]}]
set_load -pin_load 3.40189 [get_ports {P[10]}]
set_load -pin_load 3.40189 [get_ports {P[9]}]
set_load -pin_load 3.40189 [get_ports {P[8]}]
set_load -pin_load 3.40189 [get_ports {P[7]}]
set_load -pin_load 3.40189 [get_ports {P[6]}]
set_load -pin_load 3.40189 [get_ports {P[5]}]
set_load -pin_load 3.40189 [get_ports {P[4]}]
set_load -pin_load 3.40189 [get_ports {P[3]}]
set_load -pin_load 3.40189 [get_ports {P[2]}]
set_load -pin_load 3.40189 [get_ports {P[1]}]
set_load -pin_load 3.40189 [get_ports {P[0]}]
create_clock [get_ports CLK]  -name MY_CLK  -period 1.1  -waveform {0 0.55}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A_in[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B_in[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {P[0]}]
