analyze -f vhdl -lib WORK ./IIR.vhd
analyze -f vhdl -lib WORK ./reg.vhd
analyze -f vhdl -lib WORK ./sumx.vhd
analyze -f vhdl -lib WORK ./subx.vhd
analyze -f vhdl -lib WORK ./mulx.vhd

set power_preserve_rtl_hier_names true
elaborate IIR_ADV -arch bhv -lib WORK > elaborate.txt
create_clock -name MY_CLK -period 3 CLK
set_dont_touch_network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] CLK]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]

set_implementation DW01_add/bk [find cell */*add_*]
set_implementation DW02_mult/wall [find cell */*mult_*]
set_implementation DW01_sub/bk [find cell */*sub_*]

compile > ./Attempts/WALL_MUL_BK_ADD&SUB/b_compile.txt
report_timing > ./Attempts/WALL_MUL_BK_ADD&SUB/b_timing_333.3M.txt
report_area > ./Attempts/WALL_MUL_BK_ADD&SUB/b_area_report@3ns.txt
report_resource > ./Attempts/WALL_MUL_BK_ADD&SUB/b_resources_report.txt

set_dont_touch REGISTER_in
set_dont_touch REGISTER_out
optimize_registers > ./Attempts/WALL_MUL_BK_ADD&SUB/optimize_registers.txt

set_ultra_optimization true
compile_ultra > ./Attempts/WALL_MUL_BK_ADD&SUB/ultra_compile.txt
report_timing > ./Attempts/WALL_MUL_BK_ADD&SUB/timing_333.3M.txt
report_area > ./Attempts/WALL_MUL_BK_ADD&SUB/area_report@3ns.txt
report_resource > ./Attempts/WALL_MUL_BK_ADD&SUB/resources_report.txt

ungroup -all -flatten
change_names -hierarchy -rules verilog
write_sdf ./Attempts/WALL_MUL_BK_ADD&SUB/netlist/IIR.sdf
write -f verilog -hierarchy -output ./Attempts/WALL_MUL_BK_ADD&SUB/netlist/IIR.v
write_sdc ./Attempts/WALL_MUL_BK_ADD&SUB/netlist/IIR.sdc
