analyze -f vhdl -lib WORK ../IIR.vhd
analyze -f vhdl -lib WORK ../reg.vhd
analyze -f vhdl -lib WORK ../sumx.vhd
analyze -f vhdl -lib WORK ../subx.vhd
analyze -f vhdl -lib WORK ../mulx.vhd

set power_preserve_rtl_hier_names true
elaborate IIR_ADV -arch bhv -lib WORK > elaborate.txt
create_clock -name MY_CLK -period 3 CLK
set_dont_touch_network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] CLK]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]

compile -map_effort high > compile.txt

report_timing > timing_b4_opt.txt
report_area > area_b4_opt.txt
report_resource > resources_b4_opt.txt

set_dont_touch REGISTER_in
set_dont_touch REGISTER_out
optimize_registers > optimization_reg.txt

set_ultra_optimization true
compile_ultra > ultra_compile.txt

report_timing > timing_opt.txt
report_area > area_opt.txt
report_resource > resources_opt.txt

ungroup -all -flatten
change_names -hierarchy -rules verilog
write_sdf ./netlist/IIR.sdf
write -f verilog -hierarchy -output ./netlist/IIR.v
write_sdc ./netlist/IIR.sdc

